Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.88/PIC32CM-JH00/edc/PIC32CM5164JH00064.PIC
      <edc:SFRDef ltx:memberofperipheral="TCC0" edc:cname="DRVCTRL" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x42002418">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC0">
            <edc:SFRFieldDef edc:cname="NRE0" edc:nzwidth="0x1" edc:desc="Non-Recoverable State 0 Output Enable"/>
            <edc:SFRFieldDef edc:cname="NRE1" edc:nzwidth="0x1" edc:desc="Non-Recoverable State 1 Output Enable"/>
            <edc:SFRFieldDef edc:cname="NRE2" edc:nzwidth="0x1" edc:desc="Non-Recoverable State 2 Output Enable"/>
            <edc:SFRFieldDef edc:cname="NRE3" edc:nzwidth="0x1" edc:desc="Non-Recoverable State 3 Output Enable"/>
            <edc:SFRFieldDef edc:cname="NRE4" edc:nzwidth="0x1" edc:desc="Non-Recoverable State 4 Output Enable"/>
            <edc:SFRFieldDef edc:cname="NRE5" edc:nzwidth="0x1" edc:desc="Non-Recoverable State 5 Output Enable"/>
            <edc:SFRFieldDef edc:cname="NRE6" edc:nzwidth="0x1" edc:desc="Non-Recoverable State 6 Output Enable"/>
            <edc:SFRFieldDef edc:cname="NRE7" edc:nzwidth="0x1" edc:desc="Non-Recoverable State 7 Output Enable"/>
            <edc:SFRFieldDef edc:cname="NRV0" edc:nzwidth="0x1" edc:desc="Non-Recoverable State 0 Output Value"/>
            <edc:SFRFieldDef edc:cname="NRV1" edc:nzwidth="0x1" edc:desc="Non-Recoverable State 1 Output Value"/>
            <edc:SFRFieldDef edc:cname="NRV2" edc:nzwidth="0x1" edc:desc="Non-Recoverable State 2 Output Value"/>
            <edc:SFRFieldDef edc:cname="NRV3" edc:nzwidth="0x1" edc:desc="Non-Recoverable State 3 Output Value"/>
            <edc:SFRFieldDef edc:cname="NRV4" edc:nzwidth="0x1" edc:desc="Non-Recoverable State 4 Output Value"/>
            <edc:SFRFieldDef edc:cname="NRV5" edc:nzwidth="0x1" edc:desc="Non-Recoverable State 5 Output Value"/>
            <edc:SFRFieldDef edc:cname="NRV6" edc:nzwidth="0x1" edc:desc="Non-Recoverable State 6 Output Value"/>
            <edc:SFRFieldDef edc:cname="NRV7" edc:nzwidth="0x1" edc:desc="Non-Recoverable State 7 Output Value"/>
            <edc:SFRFieldDef edc:cname="INVEN0" edc:nzwidth="0x1" edc:desc="Output Waveform 0 Inversion"/>
            <edc:SFRFieldDef edc:cname="INVEN1" edc:nzwidth="0x1" edc:desc="Output Waveform 1 Inversion"/>
            <edc:SFRFieldDef edc:cname="INVEN2" edc:nzwidth="0x1" edc:desc="Output Waveform 2 Inversion"/>
            <edc:SFRFieldDef edc:cname="INVEN3" edc:nzwidth="0x1" edc:desc="Output Waveform 3 Inversion"/>
            <edc:SFRFieldDef edc:cname="INVEN4" edc:nzwidth="0x1" edc:desc="Output Waveform 4 Inversion"/>
            <edc:SFRFieldDef edc:cname="INVEN5" edc:nzwidth="0x1" edc:desc="Output Waveform 5 Inversion"/>
            <edc:SFRFieldDef edc:cname="INVEN6" edc:nzwidth="0x1" edc:desc="Output Waveform 6 Inversion"/>
            <edc:SFRFieldDef edc:cname="INVEN7" edc:nzwidth="0x1" edc:desc="Output Waveform 7 Inversion"/>
            <edc:SFRFieldDef edc:cname="FILTERVAL0" edc:nzwidth="0x4" edc:desc="Non-Recoverable Fault Input 0 Filter Value"/>
            <edc:SFRFieldDef edc:cname="FILTERVAL1" edc:nzwidth="0x4" edc:desc="Non-Recoverable Fault Input 1 Filter Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x4200241C"/>
      <edc:SFRDef ltx:memberofperipheral="TCC0" edc:cname="DBGCTRL" edc:nzwidth="0x8" edc:access="-----n-n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x5" edc:_addr="0x4200241E">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC0">
            <edc:SFRFieldDef edc:cname="DBGRUN" edc:nzwidth="0x1" edc:desc="Debug Running Mode"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FDDBD" edc:nzwidth="0x1" edc:desc="Fault Detection on Debug Break Detection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x4200241F"/>
      <edc:SFRDef ltx:memberofperipheral="TCC0" edc:cname="EVCTRL" edc:nzwidth="0x20" edc:access="----nnnn----nnnnnnnn-nnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF0FF7FF" edc:_addr="0x42002420">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC0">
            <edc:SFRFieldDef edc:cname="EVACT0" edc:nzwidth="0x3" edc:desc="Timer/counter Input Event0 Action">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Event action disabled" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RETRIGGER" edc:desc="Start, restart or re-trigger counter on event" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="COUNTEV" edc:desc="Count on event" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="START" edc:desc="Start counter on event" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="INC" edc:desc="Increment counter on event" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="COUNT" edc:desc="Count on active state of asynchronous event" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="STAMP" edc:desc="Stamp capture" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="FAULT" edc:desc="Non-recoverable fault" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EVACT1" edc:nzwidth="0x3" edc:desc="Timer/counter Input Event1 Action">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Event action disabled" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RETRIGGER" edc:desc="Re-trigger counter on event" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DIR" edc:desc="Direction control" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="STOP" edc:desc="Stop counter on event" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="DEC" edc:desc="Decrement counter on event" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="PWP" edc:desc="Period capture value in CC1 register, pulse width capture value in CC0 register" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="FAULT" edc:desc="Non-recoverable fault" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CNTSEL" edc:nzwidth="0x2" edc:desc="Timer/counter Output Event Mode">
              <edc:SFRFieldSemantic edc:cname="START" edc:desc="An interrupt/event is generated when a new counter cycle starts" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="END" edc:desc="An interrupt/event is generated when a counter cycle ends" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="BOUNDARY" edc:desc="An interrupt/event is generated when a new counter cycle starts or a counter cycle ends" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="OVFEO" edc:nzwidth="0x1" edc:desc="Overflow/Underflow Output Event Enable"/>
            <edc:SFRFieldDef edc:cname="TRGEO" edc:nzwidth="0x1" edc:desc="Retrigger Output Event Enable"/>
            <edc:SFRFieldDef edc:cname="CNTEO" edc:nzwidth="0x1" edc:desc="Timer/counter Output Event Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TCINV0" edc:nzwidth="0x1" edc:desc="Inverted Event 0 Input Enable"/>
            <edc:SFRFieldDef edc:cname="TCINV1" edc:nzwidth="0x1" edc:desc="Inverted Event 1 Input Enable"/>
            <edc:SFRFieldDef edc:cname="TCEI0" edc:nzwidth="0x1" edc:desc="Timer/counter Event 0 Input Enable"/>
            <edc:SFRFieldDef edc:cname="TCEI1" edc:nzwidth="0x1" edc:desc="Timer/counter Event 1 Input Enable"/>
            <edc:SFRFieldDef edc:cname="MCEI0" edc:nzwidth="0x1" edc:desc="Match or Capture Channel 0 Event Input Enable"/>
            <edc:SFRFieldDef edc:cname="MCEI1" edc:nzwidth="0x1" edc:desc="Match or Capture Channel 1 Event Input Enable"/>
            <edc:SFRFieldDef edc:cname="MCEI2" edc:nzwidth="0x1" edc:desc="Match or Capture Channel 2 Event Input Enable"/>
            <edc:SFRFieldDef edc:cname="MCEI3" edc:nzwidth="0x1" edc:desc="Match or Capture Channel 3 Event Input Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MCEO0" edc:nzwidth="0x1" edc:desc="Match or Capture Channel 0 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="MCEO1" edc:nzwidth="0x1" edc:desc="Match or Capture Channel 1 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="MCEO2" edc:nzwidth="0x1" edc:desc="Match or Capture Channel 2 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="MCEO3" edc:nzwidth="0x1" edc:desc="Match or Capture Channel 3 Event Output Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCC0" edc:cname="INTENCLR" edc:nzwidth="0x20" edc:access="------------nnnnnnnnnn------nnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFC0F" edc:_addr="0x42002424">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC0">
            <edc:SFRFieldDef edc:cname="OVF" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TRG" edc:nzwidth="0x1" edc:desc="Retrigger Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CNT" edc:nzwidth="0x1" edc:desc="Counter Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ERR" edc:nzwidth="0x1" edc:desc="Error Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="UFS" edc:nzwidth="0x1" edc:desc="Non-Recoverable Update Fault Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DFS" edc:nzwidth="0x1" edc:desc="Non-Recoverable Debug Fault Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="FAULTA" edc:nzwidth="0x1" edc:desc="Recoverable Fault A Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="FAULTB" edc:nzwidth="0x1" edc:desc="Recoverable Fault B Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="FAULT0" edc:nzwidth="0x1" edc:desc="Non-Recoverable Fault 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="FAULT1" edc:nzwidth="0x1" edc:desc="Non-Recoverable Fault 1 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MC0" edc:nzwidth="0x1" edc:desc="Match or Capture Channel 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MC1" edc:nzwidth="0x1" edc:desc="Match or Capture Channel 1 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MC2" edc:nzwidth="0x1" edc:desc="Match or Capture Channel 2 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MC3" edc:nzwidth="0x1" edc:desc="Match or Capture Channel 3 Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCC0" edc:cname="INTENSET" edc:nzwidth="0x20" edc:access="------------nnnnnnnnnn------nnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFC0F" edc:_addr="0x42002428">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC0">
            <edc:SFRFieldDef edc:cname="OVF" edc:nzwidth="0x1" edc:desc="Overflow Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="TRG" edc:nzwidth="0x1" edc:desc="Retrigger Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="CNT" edc:nzwidth="0x1" edc:desc="Counter Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="ERR" edc:nzwidth="0x1" edc:desc="Error Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="UFS" edc:nzwidth="0x1" edc:desc="Non-Recoverable Update Fault Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="DFS" edc:nzwidth="0x1" edc:desc="Non-Recoverable Debug Fault Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="FAULTA" edc:nzwidth="0x1" edc:desc="Recoverable Fault A Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="FAULTB" edc:nzwidth="0x1" edc:desc="Recoverable Fault B Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="FAULT0" edc:nzwidth="0x1" edc:desc="Non-Recoverable Fault 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="FAULT1" edc:nzwidth="0x1" edc:desc="Non-Recoverable Fault 1 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MC0" edc:nzwidth="0x1" edc:desc="Match or Capture Channel 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MC1" edc:nzwidth="0x1" edc:desc="Match or Capture Channel 1 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MC2" edc:nzwidth="0x1" edc:desc="Match or Capture Channel 2 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="MC3" edc:nzwidth="0x1" edc:desc="Match or Capture Channel 3 Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCC0" edc:cname="INTFLAG" edc:nzwidth="0x20" edc:access="------------nnnnnnnnnn------nnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFC0F" edc:_addr="0x4200242C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC0">
            <edc:SFRFieldDef edc:cname="OVF" edc:nzwidth="0x1" edc:desc="Overflow"/>
            <edc:SFRFieldDef edc:cname="TRG" edc:nzwidth="0x1" edc:desc="Retrigger"/>
            <edc:SFRFieldDef edc:cname="CNT" edc:nzwidth="0x1" edc:desc="Counter"/>
            <edc:SFRFieldDef edc:cname="ERR" edc:nzwidth="0x1" edc:desc="Error"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="UFS" edc:nzwidth="0x1" edc:desc="Non-Recoverable Update Fault"/>
            <edc:SFRFieldDef edc:cname="DFS" edc:nzwidth="0x1" edc:desc="Non-Recoverable Debug Fault"/>
            <edc:SFRFieldDef edc:cname="FAULTA" edc:nzwidth="0x1" edc:desc="Recoverable Fault A"/>
            <edc:SFRFieldDef edc:cname="FAULTB" edc:nzwidth="0x1" edc:desc="Recoverable Fault B"/>
            <edc:SFRFieldDef edc:cname="FAULT0" edc:nzwidth="0x1" edc:desc="Non-Recoverable Fault 0"/>
            <edc:SFRFieldDef edc:cname="FAULT1" edc:nzwidth="0x1" edc:desc="Non-Recoverable Fault 1"/>
            <edc:SFRFieldDef edc:cname="MC0" edc:nzwidth="0x1" edc:desc="Match or Capture 0"/>
            <edc:SFRFieldDef edc:cname="MC1" edc:nzwidth="0x1" edc:desc="Match or Capture 1"/>
            <edc:SFRFieldDef edc:cname="MC2" edc:nzwidth="0x1" edc:desc="Match or Capture 2"/>
            <edc:SFRFieldDef edc:cname="MC3" edc:nzwidth="0x1" edc:desc="Match or Capture 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TCC0" edc:cname="STATUS" edc:nzwidth="0x20" edc:access="----nnnn----nnnnnnnnnnnnn-n-nnnn" edc:por="00000000000000000000000000000001" edc:mclr="00000000000000000000000000000001" edc:impl="0xF0FFFAF" edc:_addr="0x42002430">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC0">
            <edc:SFRFieldDef edc:cname="STOP" edc:nzwidth="0x1" edc:desc="Stop"/>
            <edc:SFRFieldDef edc:cname="IDX" edc:nzwidth="0x1" edc:desc="Ramp"/>
            <edc:SFRFieldDef edc:cname="UFS" edc:nzwidth="0x1" edc:desc="Non-recoverable Update Fault State"/>
            <edc:SFRFieldDef edc:cname="DFS" edc:nzwidth="0x1" edc:desc="Non-Recoverable Debug Fault State"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PATTBUFV" edc:nzwidth="0x1" edc:desc="Pattern Buffer Valid"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PERBUFV" edc:nzwidth="0x1" edc:desc="Period Buffer Valid"/>
            <edc:SFRFieldDef edc:cname="FAULTAIN" edc:nzwidth="0x1" edc:desc="Recoverable Fault A Input"/>
            <edc:SFRFieldDef edc:cname="FAULTBIN" edc:nzwidth="0x1" edc:desc="Recoverable Fault B Input"/>
            <edc:SFRFieldDef edc:cname="FAULT0IN" edc:nzwidth="0x1" edc:desc="Non-Recoverable Fault0 Input"/>
            <edc:SFRFieldDef edc:cname="FAULT1IN" edc:nzwidth="0x1" edc:desc="Non-Recoverable Fault1 Input"/>
            <edc:SFRFieldDef edc:cname="FAULTA" edc:nzwidth="0x1" edc:desc="Recoverable Fault A State"/>
            <edc:SFRFieldDef edc:cname="FAULTB" edc:nzwidth="0x1" edc:desc="Recoverable Fault B State"/>
            <edc:SFRFieldDef edc:cname="FAULT0" edc:nzwidth="0x1" edc:desc="Non-Recoverable Fault 0 State"/>
            <edc:SFRFieldDef edc:cname="FAULT1" edc:nzwidth="0x1" edc:desc="Non-Recoverable Fault 1 State"/>
            <edc:SFRFieldDef edc:cname="CCBUFV0" edc:nzwidth="0x1" edc:desc="Compare Channel 0 Buffer Valid"/>
            <edc:SFRFieldDef edc:cname="CCBUFV1" edc:nzwidth="0x1" edc:desc="Compare Channel 1 Buffer Valid"/>
            <edc:SFRFieldDef edc:cname="CCBUFV2" edc:nzwidth="0x1" edc:desc="Compare Channel 2 Buffer Valid"/>
            <edc:SFRFieldDef edc:cname="CCBUFV3" edc:nzwidth="0x1" edc:desc="Compare Channel 3 Buffer Valid"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CMP0" edc:nzwidth="0x1" edc:desc="Compare Channel 0 Value"/>
            <edc:SFRFieldDef edc:cname="CMP1" edc:nzwidth="0x1" edc:desc="Compare Channel 1 Value"/>
            <edc:SFRFieldDef edc:cname="CMP2" edc:nzwidth="0x1" edc:desc="Compare Channel 2 Value"/>
            <edc:SFRFieldDef edc:cname="CMP3" edc:nzwidth="0x1" edc:desc="Compare Channel 3 Value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
